fourth_trimester_api/app/commands/authenticate_user.rb

    def user
      user = User.find_by_username(username)
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test"], ["LIMIT", 1]]